Repository: tytso/e2fsprogs
Catalog: po/*.po
Languages: tr

source: The filesystem already has sparse superblocks disabled.
tr: Dosya sisteminde süperblok azaltma bayraðý zaten etkin deðil.

source: Sparse superblock flag cleared. %s
tr: Süperblok azaltma bayraðý temizlendi. %s

source: Setting time filesystem last checked to %s
tr: Dosya sisteminin son denetim zamaný %s yapýlýyor

source: Setting reserved blocks uid to %lu
tr: Ayrýlan bloklarýn kullanýcý numarasý %lu olarak ayarlanýyor

source: Invalid UUID format
tr: Geçersiz UUID biçemi

source: Proceed anyway? (y,n)
tr: Yine de devam edilsin mi? (e/h)

source: Could not stat %s --- %s
tr: stat %s yapýlamadý --- %s

source: The device apparently does not exist; did you specify it correctly?
tr: Aygýt görünmüyor; doðru belirttiðinize emin misiniz?

source: %s is not a block special device.
tr: %s blok özellikli bir aygýt deðil.

source: %s is entire device, not just one partition!
tr: %s diskin tamamý! Bir disk bölümü deðil!

source: mke2fs forced anyway. Hope /etc/mtab is incorrect.
tr: mke2fs n'olursa olsun çalýþtýrýlacak. Ýnþallah /etc/mtab yanlýþtýr.

source: will not make a %s here!
tr: burada bir %s yapýlmayacak!

source: Couldn't allocate memory to parse journal options!
tr: Jurnal seçenekleri için bellek ayrýlamadý!

source: Filesystem too small for a journal
tr: Dosya sistemi bir jurnal için çok küçük

source: The requested journal size is %d blocks; it must be between 1024 and 102400 blocks. Aborting.
tr: Jurnal dosyasýnýn uzunluðu %d blok olarak belirtilmiþ. 1024 ile 102400 blok arasýnda olmalý. Çýkýlýyor.

source: Journal size too big for filesystem.
tr: Jurnal dosyasý dosya sistemi için çok büyük.

source: This filesystem will be automatically checked every %d mounts or %g days, whichever comes first. Use tune2fs -c or -i to override.
tr: Bu dosya sistemi her %d baðlamada bir ya da %g günde bir, hangisi önce gerçekleþirse, otomatik olarak denetlenecektir. Bu deðerleri deðiþtirmek için tune2fs'yi -c veya -i seçeneði ile çalýþtýrýnýz.

source: Usage: %s [-r] [-t]
tr: Kullanýmý: %s [seçenek] Evrendeki tek tanýmlayýcýyý (UUID) oluþturur. Seçenekler: -r rasgele sayý üreteci kullanýlarak rasgele bir numara üretilir -t varsa eternet kartýnýn adresi ve sistem zamanýna göre bir numara üretir Çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net> adresine bildiriniz.

source: # Extent dump:
tr: # Ek döküm:

source: # Num=%d, Size=%d, Cursor=%d, Sorted=%d
tr: # Num = %d, Boy = %d, Ýmleç = %d, Sýralý = %d

source: usage: %s [-d debug_flags] [-f] [-F] [-p] device [new-size]
tr: kullanýmý: %s [seçenekler] aygýt [yeni-boyut] Dosya sistemini yeniden boyutlandýrýr. Seçenekler: -d bayraklar hata ayýklama seçeneði ile derlenmiþse hata ayýklama seviyeleri belirtilir -f bazý güvenlik denetimlerini engelleyerek boyutlandýrmaya zorlar -F baþlamadan önce dosya sisteminin tampon belleklerini boþaltýr -p iþlem ilerleyiþini gösteren bir çubuk üretir Çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net> adresine bildiriniz.

source: Extending the inode table
tr: Dosya indeksi tablosu geniþletiliyor

source: Relocating blocks
tr: Bloklar yeniden konumlandýrýlýyor

source: Scanning inode table
tr: Dosya indeksi tablosu taranýyor

source: Updating inode references
tr: Dosya indeksi baþvurularý güncelleniyor

source: Moving inode table
tr: Dosya indeksi tablosu taþýnýyor

source: Unknown pass?!?
tr: bilinmeyen geçiþ?!?

source: Begin pass %d (max = %lu)
tr: Geçiþ %d baþlýyor (en çok = %lu)

source: %s is mounted; can't resize a mounted filesystem!
tr: %s baðlý; baðlý bir dosya sistemi yeniden boyutlandýrýlamaz!

source: bad filesystem size - %s
tr: dosya sistemi uzunluðu hatalý - %s

source: The filesystem is already %d blocks long. Nothing to do!
tr: Dosya sistemi zaten %d blok uzunlukta. Hiçbir þey yapýlmadý!

source: Please run 'e2fsck -f %s' first.
tr: Lütfen önce 'e2fsck -f %s' komutunu çalýþtýrýn.

source: while trying to resize %s
tr: - %s yeniden boyutlandýrýlýrken hata oluþtu

source: The filesystem on %s is now %d blocks long.
tr: %s üzerindeki dosya sistemi þimdi %d blok uzunlukta.

source: Number of free blocks: %d/%d, Needed: %d
tr: Serbest blok sayýsý: %d/%d, Gereken: %d

source: meta-data blocks
tr: meta-veri bloklarý

source: reserved blocks
tr: yedek bloklar

source: blocks to be moved
tr: taþýnacak bloklar

source: Going into desperation mode for block allocations
tr: Blok tahsislerinde umutsuz kipe geçiliyor

source: Moving %d blocks %u->%u
tr: %d blok taþýnýyor %u->%u

source: ino=%u, blockcnt=%lld, %u->%u
tr: düðüm = %u, block_sayýsý = %lld, %u->%u

source: Inode moved %u->%u
tr: Düðüm taþýndý %u->%u

source: Inode translate (dir=%u, name=%.*s, %u->%u)
tr: Düðüm çevirisi (dizin = %u, isim= %.*s, %u->%u)

source: Itable move group %d block %u->%u (diff %d)
tr: Düðüm tablosu %d. grubun bloklarý %u -> %u arasýnda taþýnýyor (fark %d)

source: %d blocks of zeros...
tr: %d sýfýrlý blok...

source: Inode table move finished.
tr: Düðüm tablosunun taþýnmasý tamamlandý.
