Repository: tytso/e2fsprogs
Catalog: po/*.po
Languages: tr

source: Primary
tr: Ýlk

source: Backup
tr: Yedek

source: , Group descriptors at
tr: Grup tanýmlayýcý:

source: Group descriptor at
tr: Grup tanýmlayýcý:

source: Block bitmap at
tr: Blok biteþlemi:

source: , Inode bitmap at
tr: Düðüm biteþlemi:

source: Inode table at
tr: Düðüm tablosu:

source: %d free blocks, %d free inodes, %d directories
tr: %d serbest blok, %d serbest düðüm, %d dizin

source: Free blocks:
tr: Serbest bloklar:

source: Free inodes:
tr: Serbest düðümler:

source: while printing bad block list
tr: - hatalý bloklar listesi basýlýrken hata oluþtu

source: Bad blocks: %d
tr: Hatalý bloklar: %d

source: while reading journal superblock
tr: - jurnal süperbloðu okunurken hata oluþtu

source: Couldn't find journal superblock magic numbers
tr: Jurnal süperbloðu taným numarasý bulunamadý

source: Journal block size: %d Journal length: %d Journal first block: %d Journal sequence: 0x%08x Journal start: %d Journal number of users: %d
tr: Jurnal bloðu boyu: %d Jurnal uzunluðu: %d Jurnal ilk bloðu: %d Jurnal sýralamasý: 0x%08x Jurnal baþlangýcý: %d Jurnal kullanýcý sayýsý: %d

source: Using %s
tr: %s kullanýlýyor

source: Couldn't find valid filesystem superblock.
tr: Geçerli süperblok bulunamadý.

source: Note: This is a byte-swapped filesystem
tr: Bilgi: Bu bir ters-baytlý dosya sistemi

source: %s: %s: error reading bitmaps: %s
tr: %s: %s: biteþlemler okunurken hata oluþtu: %s

source: Usage: %s [-r] device file
tr: Kullanýmý: %s [-r] AYGIT DOSYA AYGIT üzerindeki ext2 dosya sisteminin kritik verilerini DOSYAya kaydeder. Örn: 4GB lýk bir sistem için yaklaþýk 3MB lýk bir görüntü dosyasý oluþturulur. Bu dosya, dosya sistemini kurtarmak için uzmanlarca kullanýlabilir. Belli aralýklarla bu dosyanýn baþka bir dosya sistemine kaydedilmesi önerilir. -r seçeneði temel biçemli bir dosya üretir, çok büyük olacaðýndan önerilmez. DOSYA yerine - verilirse dosya standart çýktýya yazýlýr.

source: Couldn't allocate header buffer
tr: Baþlýk için tampon bellek ayrýlamadý

source: while writing superblock
tr: - süperbloða yazýlýrken hata oluþtu

source: while writing inode table
tr: - düðüm tablosuna yazýlýrken hata oluþtu

source: while writing block bitmap
tr: - blok biteþlemi yazýlýrken hata oluþtu

source: while writing inode bitmap
tr: - düðüm biteþlemi yazýlýrken hata oluþtu

source: e2label: cannot open %s
tr: e2label: %s açýlamýyor

source: e2label: cannot seek to superblock
tr: e2label: süperbloka eriþilemiyor

source: e2label: error reading superblock
tr: e2label: süperblok okunurken hata oluþtu

source: e2label: not an ext2 filesystem
tr: e2label: bir ext2 dosya sistemi deðil

source: Warning: label too long, truncating.
tr: Uyarý: etiket çok uzun, kýrpýlýyor.

source: e2label: cannot seek to superblock again
tr: e2label: süperbloða yine eriþilemedi

source: e2label: error writing superblock
tr: e2label: süperbloða yazýlýrken hata oluþtu

source: Usage: e2label device [newlabel]
tr: Kullanýmý: e2label AYGIT [etiket] AYGIT bölüm ismini atamak/okumak için kullanýlýr.

source: Usage: findsuper device [skipbytes [startkb]]
tr: Kullanýmý: findsuper aygýt [atlanacak_baytlar [baþlangýç_kb]]

source: skipbytes must be a multiple of the sector size
tr: atlanacak_baytlar sektör boyunun katlarý olmalý

source: startkb should be a number, not %s
tr: baþlangýç_kb bir sayý olmalý, %s deðil

source: startkb should be positive, not %Ld
tr: baþlangýç_kb poritif olmalý, %Ld deðil

source: starting at %Ld, with %d byte increments
tr: %Ld de baþlayýp %d bayt arttýrýmla

source: thisoff block fs_blk_sz blksz grp last_mount
tr: thisoff blok ds_blok_boyu blokboyu grup son_baðlama

source: %14Ld: finished with errno %d
tr: %14Ld: %d hatasý ile bitti

source: WARNING: couldn't open %s: %s
tr: UYARI: %s açýlamadý: %s

source: WARNING: bad format on line %d of %s
tr: UYARI: %2$s nin %1$d. satýrýnda biçem hatasý

source: WARNING: Your /etc/fstab does not contain the fsck passno field. I will kludge around things for you, but you should fix your /etc/fstab file as soon as you can.
tr: ***UYARI: /etc/fstab dosyanýzda fsck geçiþ sayýsý alaný bulunmuyor. Bu seferlik iþlem yapýlacak, ancak en kýsa zamanda bu dosyayý düzeltmelisiniz.

source: fsck: %s: not found
tr: fsck: %s: yok

source: %s: wait: No more child process?!?
tr: %s: bekliyor: Baþka ast süreç yok?!?

source: Warning... %s for device %s exited with signal %d.
tr: Uyarý... %s %s aygýtý için %d sinyali ile çýktý.

source: %s %s: status is %x, should never happen.
tr: %s %s: durum %x, asla olmamalýydý.

source: Finished with %s (exit status %d)
tr: %s ile bitti (çýkýþ durumu: %d)

source: %s: Error %d while executing fsck.%s for %s
tr: %s: Hata %d: fsck.%s %s için çalýtýrýlýrken oluþtu.

source: Either all or none of the filesystem types passed to -t must be prefixed with 'no' or '!'.
tr: -t ile ister tüm dosya sistemi türleri belirtilsin ister bir dosya sistemi türü belirtilmesin, ya 'no' ya da '!' öneki kullanýlmalýdýr.

source: Couldn't allocate memory for filesystem types
tr: Dosya sistemi türleri için bellek ayrýlamadý

source: fsck: cannot check %s: fsck.%s not found
tr: fsck: %s denetlenemiyor: fsck.%s yok

source: Checking all file systems.
tr: Tüm dosya sistemleri denetleniyor.

source: --waiting-- (pass %d)
tr: --beklemede-- (%d. geçiþ)

source: Usage: fsck [-ACNPRTV] [-t fstype] [fs-options] [filesys ...]
tr: Kullanýmý: fsck [-sACNPRTV] [-t dstürü] [ds-seçenekleri] [dosyasistemi ...] Bir ya da daha fazla dosya sistemini denetlemek veya istenirse onarmak için kullanýlýr. dosyasistemi olarak bir disk bölümü, bir baðlama noktasý, bir bölüm etiketi ya da UUID verilebilir. Seçenekler: -s Denetimi hýzlandýrýr. Etkileþimli kipte iyi bir seçimdir. -t dstürü Denetlenecek dosya sistemlerinin türleri belirtilir. -A /etc/fstab dosyasýndaki denetlenmesi öngörülmüþ sistemlerin denetimleri yapýlýr. -C Denetim süreci bir göstergeyle gösterilir. -N Denetim yapýlýyormuþ gibi görünür, bir þey yapýlmaz. -P -A seçeneði ile birlikte kullanýlarak kök dosya sistemi denetlenirken diðer dosya sistemleri de paralel denetlenir -R -A seçeneði ile kullanýldýðýnda kök dosya sistemi denetlenmez. -T Baþlangýçta baþlýk gösterilmez. -V Ýþlemler sýrasýnda daha fazla ayrýntý verilir. fsck seçenekleri: Bu seçenekler ext2fs dýþýndaki dosya sistemleri için garanti edilmez. -a Hiç bir soru sormadan sistem otomatik olarak denetlenir ve onarýlýr. -r Ýþlemler etkileþimli olarak yapýlýr. Paralel denetimler için önerilmez. Çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net> adresine bildiriniz.

source: %s: too many devices
tr: %s: aygýt sayýsý çok fazla

source: %s: too many arguments
tr: %s: argüman sayýsý fazla

source: Usage: %s [-RVadlv] [files...]
tr: Kullanýmý: %s [-RVadv] [dosyalar...] Dosyalarýn özelliklerini listeler. Seçenekler: -a '.' ile baþlayanlar dahil dizinlerin içindeki tüm dosyalarý listeler -d dosyalar gibi dizinleri de listeler -R dizinler ve içerikleri ardýþýk olarak listelenir -V sürüm bilgileri gösterilir -v dosyalarýn sürüm/üretim numaralarýný listeler Çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net> adresine bildiriniz.

source: While reading flags on %s
tr: - %s üzerinde bayraklar okunurken hata oluþtu

source: While reading version on %s
tr: - %s üzerinde sürüm okunurken hata oluþtu

source: Usage: %s [-c|-t|-l filename] [-b block-size] [-f fragment-size] [-i bytes-per-inode] [-j] [-J journal-options] [-N number-of-inodes] [-m reserved-blocks-percentage] [-o creator-os] [-g blocks-per-group] [-L volume-label] [-M last-mounted-directory] [-O feature[,...]] [-r fs-revision] [-R raid_opts] [-qvSV] device [blocks-count]
tr: Kullanýmý: %s [seçenekler] aygýt [blok-sayýsý] Genellikle bir disk bölümü üzerinde bir ext2 dosya sistemi oluþturur. ext3 de desteklenmiþtir. Seçenekler: -b 1024|2048|4096 dosya sisteminin blok uzunluðu belirtilir -c salt-okunur kipte hatalý bloklar aranýr -f adým-boyu bu sürümde adým boyu blok boyuna eþittir -F aygýt blok özellikli olmasa bile bir dosya sistemi oluþturulur -g her-gruptaki-blok-sayýsý -i dosya-indeksi-uzunluðu boþ bir dizinin disk üzerinde kaplayabileceði en küçük alan, bayt cinsinden verilir. -j ext3 dosya sistemi için jurnal dosyasý oluþturur -J ile jurnal dosyasýnýn özellikleri verilmezse dosya öntanýmlý özelliklrele oluþturulur. DÝKKAT: Linux çekirdeðinde ext3 desteði yoksa sistem ext2 olarak kullanýlabilir -J jurnal-seçenekleri jurnal seçenekleri aþaðýda verilmiþtir -l DOSYA hatalý bloklar DOSYAdan okunur -L etiket dosya sistemine bir etiket atar -m yedek-blok-yüzdesi root kullanýcý için ayrýlan yedek bloklarýn yüzdesi. Öntanýmlý deðeri %%5 tir -M son-baðlanan-dizin dosya istemine son baðlanan dizin belirtilir -n dosya sistemi oluþturulmaz, sadece iþlemleri gösterir -N dosya-indeksi-sayýsý sistemdeki toplam dosya indeksi sayýsý belirtilir -o iþletim-sistemi dosya sisteminin 'creator os' alanýna yazýlacak deðer. Normalde Linux'tur. -O özellik[,...] belirtilen özellikte dosya sistemi oluþturur. Özellikler aþaðýda verilmiþtir. -q iþlem sýrasýnda bilgi verilmez -r dosya-sistemi-sürümü 1.2 çekirdekler dýþýnda öntanýmlý deðeri 1 dir -R raid_seçenekleri bu seçenekler için man sayfasýna bakýnýz -S kurtarma amacýyla sadece süper blok ve grup tanýmlayýcýlar yeniden yazýlýr -T dosya-sistemi-türü dosya sisteminin nasýl kullanýlacaðý belirtilir Türler için man sayfasýna bakýnýz. -v iþlem sýrasýnda ayrýntýlý bilgi verilir -V sürüm bilgileri gösterilir ve çýkar Jurnal seçenekleri: size=jurnal-uzunluðu Jurnal dosyasýnýn uzunluðu MB olarak belirtilir device=dýþ-jurnal-aygýtý Baþka bir aygýt üzerindeki jurnal dosyasýnýn kullanýlmasý saðlanýr. Özellikler: sparse_super Yedek süperbloklarýn sayýsýný sýnýrlamakta kullanýlýr. filetype Dizin kayýtlarýnda dosya türü bilgisi saklanýr. has_journal -j seçeneði ile ayný. Bir ext3 jurnal dosyasý oluþturur. Çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net> adresine bildiriniz.

source: Running command: %s
tr: Çalýþan komut: %s

source: while trying run '%s'
tr: - '%s' çalýþtýrýlýrken hata oluþtu

source: while processing list of bad blocks from program
tr: - hatalý bloklar listesi iþlenirken hata oluþtu

source: Block %d in primary superblock/group descriptor area bad.
tr: Birincil süperblok/grup tanýmý alanýndaki blok %d hatalý

source: Blocks %d through %d must be good in order to build a filesystem.
tr: Bir dosya sistemi oluþturulurken %d den %d ye kadar olan bloklar hatasýz olmak zorundadýr.

source: Aborting....
tr: Çýkýlýyor...

source: Warning: the backup superblock/group descriptors at block %d contain bad blocks.
tr: Uyarý: Blok %d deki yedek süperblok/grup tanýmý "hatalý bloklar" içeriyor.

source: while marking bad blocks as used
tr: - hatalý bloklar kullanýlmýþ olarak imlenirken hata oluþtu

source: done
tr: bitti

source: while allocating zeroizing buffer
tr: - sýfýrlama tampon belleði ayrýlýrken hata oluþtu

source: Writing inode tables:
tr: Düðüm tablolarý yazýlýyor:

source: Could not write %d blocks in inode table starting at %d: %s
tr: %2d de baþlayan düðüm tablosundaki %1d blok yazýlamadý: %3s

source: while creating root dir
tr: - kök dizin oluþturulurken hata

source: while reading root inode
tr: - kök düðümü okunurken hata oluþtu

source: while setting root inode ownership
tr: - kök düðümünün sahibi belirlenirken hata oluþtu

source: while creating /lost+found
tr: - /lost+found dizini oluþturulurken hata oluþtu

source: while looking up /lost+found
tr: - /lost+found dizine bakýlýrken hata oluþtu

source: while expanding /lost+found
tr: - /lost+found dizini geniþletilirken hata oluþtu

source: while setting bad block inode
tr: - hatalý blok düðümü belirlenirken hata oluþtu

source: Out of memory erasing sectors %d-%d
tr: %d-%d arasýndaki sektörler silinirken bellek yetmedi

source: Warning: could not read block 0: %s
tr: Uyarý: blok 0 okunamadý: %s

source: Warning: could not erase sector %d: %s
tr: Uyarý: %d. sektör silinemedi: %s

source: while initializing journal superblock
tr: - jurnal superbloðu ilklendirilirken hata oluþtu

source: Zeroing journal device:
tr: Jurnal aygýtý temizleniyor:

source: while zeroing journal device (block %u, count %d)
tr: - jurnal aygýtý temizlenirken (blok %u, %d blok) hata oluþtu

source: while writing journal superblock
tr: - jurnal süperbloðu yazýlýrken hata oluþtu

source: warning: %d blocks unused.
tr: uyarý: %d blok kullanýlmamýþ.

source: Filesystem label=%s
tr: Dosya sistemi ismi = %s

source: OS type:
tr: Ýþl. Sist. türü:

source: (unknown os)
tr: (bilinmeyen iþl. sist.)

source: Block size=%u (log=%u)
tr: Blok boyu = %u (günlük kaydý = %u)

source: Fragment size=%u (log=%u)
tr: Adýmlama boyu = %u (günlük kaydý = %u)

source: %u inodes, %u blocks
tr: %u düðüm, %u blok

source: %u blocks (%2.2f%%) reserved for the super user
tr: %u blok (%%%2.2f) süper kullanýcý için ayrýldý

source: First data block=%u
tr: Ýlk veri bloðu = %u

source: %u block groups
tr: %u blok grubu

source: %u block group
tr: %u blok grubu

source: %u blocks per group, %u fragments per group
tr: Grup baþýna %u blok ve %u sekme

source: %u inodes per group
tr: grup baþýna %u düðüm

source: Superblock backups stored on blocks:
tr: Süperbloklarýn bulunduðu bloklar:

source: Couldn't allocate memory to parse raid options!
tr: Raid seçenekleri için bellek ayrýlamadý!

source: Invalid stride parameter.
tr: 'stride' parametresi geçersiz.

source: Bad raid options specified. Raid options are separated by commas, and may take an argument which is set off by an equals ('=') sign. Valid raid options are: stride=<stride length in blocks>
tr: Belirtilen raid seçenekleri hatalý. Raid seçenekleri '=' iþaretli çiftler virgüllerle ayrýlarak verilir. Geçerli raid seçenekleri: stride=<bloklardaki adým uzunluðu>

source: Warning: blocksize %d not usable on most systems.
tr: Uyarý: blok uzunluðu %d birçok sistemde kullanýmdýþýdýr.

source: bad fragment size - %s
tr: sekme boyu hatalý - %s

source: Warning: fragments not supported. Ignoring -f option
tr: Uyarý: sekmeler desteklenmediðinden -f seçeneði yoksayýlýyor

source: Illegal number for blocks per group
tr: Grup baþýna blok sayýsý kuraldýþý

source: blocks per group must be multiple of 8
tr: grup baþýna blok sayýsý 8'in katlarý olmalýdýr

source: bad inode ratio %s (min %d/max %d
tr: düðüm oraný %s hatalý (en az %d/en çok %d)

source: in malloc for bad_blocks_filename
tr: - bad_blocks_filename için bellek ayrýlýrken

source: bad reserved blocks percent - %s
tr: yedek blok yüzdesi hatalý - %s

source: bad inode size - %s
tr: düðüm uzunluðu hatalý - %s

source: Invalid filesystem option set: %s
tr: Geçersiz dosya sistemi seçeneði: %s

source: while trying to open journal device %s
tr: - %s jurnal aygýtý açýlmaya çalýþýlýrken hata

source: %d-byte blocks too big for system (max %d)
tr: %d baytlýk bloklar sistem için çok büyük (en çok %d)

source: Warning: %d-byte blocks too big for system (max %d), forced to continue
tr: Uyarý: %d baytlýk bloklar sistem için çok büyük (en çok %d), ama devam ediliyor

source: filesystem
tr: dosya sistemi

source: while trying to determine filesystem size
tr: - dosya sistemi uzunluðu saptanmaya çalýþýlýrken hata oluþtu

source: Couldn't determine device size; you must specify the size of the filesystem
tr: Aygýt alaný saptanamadý; dosya sistemi için bir uzunluk belirtmelisiniz

source: Device size reported to be zero. Invalid partition specified, or partition table wasn't reread after running fdisk, due to a modified partition being busy and in use. You may need to reboot to re-read your partition table.
tr: Aygýttaki alan sýfýr olarak raporlandý. Ya deðiþtirilen bir disk bölümü hala meþgul veya kullanýmda olduðundan fdisk çalýþtýrýldýktan sonra disk bölümleme tablosu yeniden okunamadý ya da yanlýþ bölüm belirtildi. Disk bölümleme tablosunun yeniden okunmasý için sisteminizi yeniden baþlatmalýsýnýz.

source: blocks per group count out of range
tr: Grup baþýna blok sayýsý kapsamdýþý

source: bad inode size %d (min %d/max %d)
tr: düðüm uzunluðu %d hatalý (en az %d/en çok %d)

source: Warning: %d-byte inodes not usable on most systems
tr: Uyarý: %d baytlýk düðümler bir çok sistemde kullanýmdýþýdýr.

source: while setting up superblock
tr: - süperblok ayarlanýrken hata oluþtu

source: unknown os - %s
tr: bilinmeyen iþletim sistemi - %s

source: while trying to allocate filesystem tables
tr: - dosya sistemi tablolarý ayrýlmaya çalýþýlýrken hata oluþtu

source: while zeroing block %u at end of filesystem
tr: dosya sisteminin sonunda blok %u sýfýrlanýrken

source: journal
tr: jurnal

source: Adding journal to device %s:
tr: %s'e jurnal ekleniyor:

source: while trying to add journal to device %s
tr: jurnal %s e eklenmeye çalýþýlýrken hata oluþtu

source: done
tr: tamam

source: Creating journal (%d blocks):
tr: Jurnal oluþturuluyor (%d blok):

source: while trying to create journal
tr: jurnal oluþturulmaya çalýþýlýrken hata oluþtu

source: Writing superblocks and filesystem accounting information:
tr: Süperbloklarýn ve dosya sisteminin hesap bilgileri yazýlýyor:

source: Warning, had trouble writing out superblocks.
tr: Uyarý, süperbloklarýn tamamýna yazma sorunu var.

source: done
tr: bitti

source: Usage: mklost+found
tr: Kullanýmý: mklost+found

source: %s failed for %s: %s
tr: %s %s için baþarýsýz: %s

source: Usage: %s <dev1> <dev2> <dev3> This program prints out the partition information for a set of devices A common way to use this program is: %s /dev/hda?
tr: Kullanýmý: %s <aygýt1> <aygýt2> <aygýt3> Bir aygýt kümesi için disk bölümleme bilgilerini gösterir Bu uygulamanýn çok kullanýlan biçimi: %s /dev/hda?

source: Please run e2fsck on the filesystem.
tr: Lütfen dosya sisteminde e2fsck çalýþtýrýn.

source: Usage: %s [-c max-mounts-count] [-e errors-behavior] [-g group] [-i interval[d|m|w]] [-j] [-J journal-options] [-l] [-s sparse-flag] [-m reserved-blocks-percent] [-o [^]mount-options[,...]] [-r reserved-blocks-count] [-u user] [-C mount-count] [-L volume-label] [-M last-mounted-dir] [-O [^]feature[,...]] [-T last-check-time] [-U UUID] device
tr: Kullanýmý: %s [seçenekler] aygýt Dosya sisteminin ayarlanabilir parametrelerini deðiþtirmekte kullanýlýr. Seçenekler: -c SAYI Ýki dosyasistemi denetimi arasýnda dosya sisteminin en çok kaç defa baðlanabileceði belirtilir. -C SAYI -c ile ayný -e hata-davranýþý Hata oluþtuðunda ne yapýlacaðý belirtilir. 'continue': hata yoksayýlýr. 'remount-ro': dosya sistemi salt-okunur olarak baðlanýr. 'panic': çekirdek paniði oluþur. -g grup Yedek bloklarýn hangi kullanýcý grubuna ayrýlacaðý belirtilir. Grup ismi ya da numarasý verilebilir. -u kullanýcý Yedek bloklarýn hangi kullanýcýya ayrýlacaðý belirtilir. Kull. ismi ya da numarasý verilebilir. -i süre[d|m|w] Ýki denetim arasýndaki en büyük süre belirtilir. Gün(d), ay(m), hafta(w) olarak verilebilir. 0 ile zamana baðlý denetim ayarý kaldýrýlýr. -j Dosya sistemine jurnal dosyasý eklenir. -J seçeneði ile seçenekler belirtilmezse dosya öntanýmlý özelliklerle oluþturulur. -J seçenek[,...] Aþaðýda açýklamalarý verilen seçenekler burada virgüllerle ayrýlarak verilebilir. -l Dosya sisteminin özellikleri listelenir. -L etiket Dosya sisteminin bölüm ismi belirtilir. -m yedek-blok-yüzdesi Yedek bloklarýn yüzdesi belirtilir. Öntanýmlý %%5 -M DÝZÝN Dosya sistemine son baðlanan dizin belirtilir. -o [^]özellik[,...] Baðlama seçenekleri -O [^]özellik[,...] Aþaðýda açýklamalarý verilen özellikler burada virgüllerle ayrýlarak verilebilir. -r yedek-blok-sayýsý Yedek bloklarýn sayýsý belirtilir. -s [0|1] Çok büyük dosya sistemlerinde yer kazandýrýr. -O sparse_super ile aynýdýr. -T son-denetim-zamaný Betiklerle kullanmak içindir -U UUID|clear|random|time Dosya sisteminin evrensel tek kimliði veya (UUID) hangi yöntemle belirleneceði belirtilir.'clear' ile silinir; 'random' rasgele, 'time' zamana göre bir kimlik üretir. Jurnal seçenekleri: size=jurnal-uzunluðu Jurnal dosyasýnýn uzunluðu MB olarak belirtilir device=dýþ-jurnal-aygýtý Baþka bir aygýt üzerindeki jurnal dosyasýnýn kullanýlmasý saðlanýr. Özellikler: '^' öneki ile verilen özellikler süperbloða eskiler kaldýrýlarak yazýlýr. '+' önekiyle ya da öneksiz verilen özellikler süperbloktaki özelliklere eklenir. sparse_super Yedek süperbloklarýn sayýsýný sýnýrlamakta kullanýlýr. filetype Dizin kayýtlarýnda dosya türü bilgisi saklanýr. has_journal -j seçeneði ile ayný. Bir ext3 jurnal dosyasý oluþturur. Çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net> adresine bildiriniz.

source: while trying to open external journal
tr: - dýþ jurnal açýlmaya çalýþýlýrken hata oluþtu

source: %s is not a journal device.
tr: %s bir jurnal aygýtý deðil.

source: Journal superblock not found!
tr: Jurnal süperbloðu yok!

source: Filesystem's UUID not found on journal device.
tr: Jurnal aygýtýnda dosya sisteminin evrensel tek kimliði (UUID) yok.

source: Journal NOT removed
tr: Jurnal silinMEdi

source: Journal removed
tr: Jurnal silindi

source: while reading journal inode
tr: - jurnal düðümü okunurken hata oluþtu

source: while reading bitmaps
tr: - biteþlemler okunurken hata oluþtu

source: while clearing journal inode
tr: - jurnal düðümü temizlenirken hata oluþtu

source: while writing journal inode
tr: - jurnal düðümü yazýlýrken hata oluþtu

source: Invalid mount option set: %s
tr: Geçersiz dosya sistemi seçeneði belirtidi: %s

source: The has_journal flag may only be cleared when the filesystem is unmounted or mounted read-only.
tr: has_journal bayraðý sadece dosya sistemi baðlý deðilken ya da salt-okunur baðlýyken temizlenebilir.

source: The needs_recovery flag is set. Please run e2fsck before clearing the has_journal flag.
tr: needs_recovery bayraðý gerekiyor. Lütfen has_journal bayraðý temizlenmeden önce e2fsck çalýþtýrýn.

source: The filesystem already has a journal.
tr: Dosya sisteminde bir jurnal dosyasý zaten var.

source: while trying to open journal on %s
tr: %s üzerindeki jurnal açýlmaya çalýþýlýrken hata oluþtu

source: Creating journal on device %s:
tr: %s üzerinde jurnal dosyasý oluþturuluyor:

source: while adding filesystem to journal on %s
tr: - %s üzerindeki jurnal dosyasýna dosya sistemi eklenirken hata oluþtu

source: Creating journal inode:
tr: Jurnal düðümü oluþturuluyor:

source: while trying to create journal file
tr: jurnal dosyasý oluþturulmaya çalýþýlýrken hata oluþtu

source: Couldn't parse date/time specifier: %s
tr: Tarih/zaman belirteci çözümlenemedi: %s

source: bad mounts count - %s
tr: baðlama sayýsý hatalý - %s

source: bad error behavior - %s
tr: hata davranýþý hatalý - %s

source: bad gid/group name - %s
tr: grup ismi/numarasý hatalý -%s

source: bad interval - %s
tr: süre hatalý - %s

source: bad reserved block ratio - %s
tr: yedek blok oraný hatalý - %s

source: -o may only be specified once
tr: -o yalnýz bir kere kullanýlabilir

source: -O may only be specified once
tr: -O yalnýz bir kere kullanýlabilir

source: bad reserved blocks count - %s
tr: yedek blok sayýsý hatalý - %s

source: bad uid/user name - %s
tr: kullanýcý ismi/numarasý hatalý - %s

source: Setting maximal mount count to %d
tr: En fazla baðlama sayýsý %d olarak belirleniyor

source: Setting current mount count to %d
tr: Þimdiki baðlama sayýsý %d olarak belirleniyor

source: Setting error behavior to %d
tr: Hata davranýþý %d olarak belirleniyor

source: Setting reserved blocks gid to %lu
tr: Yedek bloklarýn grup numarasý %lu olarak belirleniyor

source: Setting interval between check %lu seconds
tr: Denetimler arasýndaki süre %lu saniye olarak belirleniyor

source: Setting reserved blocks percentage to %lu (%u blocks)
tr: Yedek bloklarýn yüzdesi %lu (%u blok) olarak belirleniyor

source: reserved blocks count is too big (%ul)
tr: yedek blok sayýsý çok büyük (%ul)

source: Setting reserved blocks count to %lu
tr: Yedek blok sayýsý %lu olarak belirleniyor

source: The filesystem already has sparse superblocks.
tr: Dosya sistemindeki süperbloklar zaten azaltýlmýþ.

source: Sparse superblock flag set. %s
tr: Süperblok azaltma bayraðý konuldu. %s
