Repository: tytso/e2fsprogs
Catalog: po/*.po
Languages: tr

source: @d @i %i, @b %B, offset %N: @d corrupted
tr: Dizin düðümü %i, blok %B, konum %N: dizin bozuk

source: @d @i %i, @b %B, offset %N: filename too long
tr: Dizin düðümü %i, blok %B, konum %N: dosya ismi çok uzun

source: @d @i %i has an unallocated @b #%B.
tr: Dizin düðümü %i bir ayrýlmayan blok #%B içeriyor.

source: '.' @d @e in @d @i %i is not NULL terminated
tr: Dizin düðümü %i deki '.' dizin girdisi NULL sonlandýrmalý deðil

source: '..' @d @e in @d @i %i is not NULL terminated
tr: Dizin düðümü %i deki '..' dizin girdisi NULL sonlandýrmalý deðil

source: @i %i (%Q) is an @I character @v.
tr: Düðüm %i (%Q) bir kuraldýþý karakter aygýtý.

source: @i %i (%Q) is an @I @b @v.
tr: Düðüm %i (%Q) bir kuraldýþý blok aygýtý.

source: @E is duplicate '.' @e.
tr: @E tekrarlayan '.' girdisi içeriyor.

source: @E is duplicate '..' @e.
tr: @E tekrarlayan '..' girdisi içeriyor.

source: Internal error: couldn't find dir_info for %i.
tr: Ýç hata: %i için dizin bilgileri bulunamýyor.

source: @E has rec_len of %Dr, should be %N.
tr: @E %Dr kayýt uzunluðunda, %N olmalýydý.

source: @A icount structure: %m
tr: icount veri yapýsý için yer ayrýlýrken hata oluþtu: %m

source: Error reading @d @b %b (@i %i): %m
tr: Dizin bloðu %b (düðüm %i) okunurken hata oluþtu: %m

source: Error writing @d @b %b (@i %i): %m
tr: Dizin bloðu %b (düðüm %i) yazýlýrken hata oluþtu: %m

source: @A new @d @b for @i %i (%s): %m
tr: Düðüm %i için yeni dizin bloku ayrýlýrken hata oluþtu (%s): %m

source: Error deallocating @i %i: %m
tr: Düðüm %i býrakýlýrken hata: %m

source: @d @e for '.' is big.
tr: '.' için dizin girdisi büyük.

source: @i %i (%Q) is an @I FIFO.
tr: Düðüm %i (%Q) bir kuraldýþý FIFO.

source: @i %i (%Q) is an @I socket.
tr: Düðüm %i (%Q) bir kuraldýþý soket.

source: Setting filetype for @E to %N.
tr: @E için dosya türü %N olarak belirleniyor.

source: @E has an incorrect filetype (was %Dt, should be %N).
tr: @E yanlýþ dosya türünde (%Dt idi, %N olmalýydý).

source: @E has filetype set.
tr: @E için dosya türü belirtilmiþ.

source: @E has a zero-length name.
tr: @Enin ismi sýfýr uzunlukta.

source: Symlink %Q (@i #%i) is invalid.
tr: %Q sembolik baðýnýn (düðüm #%i) uzunluðu geçersiz.

source: @f contains large files, but lacks LARGE_FILE flag in @S.
tr: Dosya sistemi çok büyük dosyalar içeriyor, ama süperblokta LARGE_FILE bayraðý yok

source: @p @h %d: node (%B) not referenced
tr: HTREE dizin düðümü %d içinde sorun: düðüm (%B) referanssýz

source: @p @h %d: node (%B) referenced twice
tr: HTREE dizin düðümü %d içinde sorun: düðüm (%B) iki kere referanslý

source: @p @h %d: node (%B) has bad min hash
tr: HTREE dizin düðümü %d içinde sorun: düðüm (%B) hatali asgari hash içeriyor

source: @p @h %d: node (%B) has bad max hash
tr: HTREE dizin düðümü %d içinde sorun: düðüm (%B) hatali azami hash içeriyor

source: Invalid @h %d (%q).
tr: HTREE dizin düðümü %d (%q) geçersiz.

source: Forcibly clearing HTREE flag on @i %d (%q). (Beta test code)
tr: Düðüm %d (%q) üzerindeki HTREE bayraðý zorla temizleniyor. (Beta test kodu)

source: @p @h %d (%q): bad @b number %b.
tr: HTREE dizin düðümü %d içinde sorun: blok numarasý %b hatalý.

source: @p @h %d: root node is invalid
tr: HTREE dizin düðümü %d içinde sorun: kök düðümü geçersiz

source: @p @h %d: node (%B) has bad limit (%N)
tr: HTREE dizin düðümü %d içinde sorun: düðüm (%B) hatalý sýnýr (%N) içeriyor

source: @p @h %d: node (%B) has bad count (%N)
tr: HTREE dizin düðümü %d içinde sorun: düðüm (%B) hatalý sayým (%N) içeriyor.

source: @p @h %d: node (%B) has an unordered hash table
tr: HTREE dizin düðümü %d içinde sorun: düðüm (%B) sýrasýz bit hash tablosu içeriyor

source: @p @h %d: node (%B) has bad depth
tr: HTREE dizin düðümü %d içinde sorun: düðüm (%B) hatalý derinlikte

source: Pass 3: Checking @d connectivity
tr: Geçiþ 3: Dizin baðlanabilirliði denetleniyor

source: @r not allocated.
tr: Kök düðümü tahsisli deðil.

source: No room in @l @d.
tr: lost+found dizininde yer yok.

source: Unconnected @d @i %i (%p)
tr: Dizin düðümü %i (%p) baðlantýsýz

source: /@l not found.
tr: /lost+found dizini yok.

source: '..' in %Q (%i) is %P (%j), @s %q (%d).
tr: %Q (%i) daki '..' %P (%j), süperblok %q (%d).

source: Bad or non-existent /@l. Cannot reconnect.
tr: /lost+found dizini ya yok ya da hatalý. tekrar baðlanýlamýyor.

source: Could not expand /@l: %m
tr: /lost+found dizini geniþletilemiyor: %m

source: Could not reconnect %i: %m
tr: %i ye tekrar baðlanýlamýyor: %m

source: Error while trying to find /@l: %m
tr: /lost+found dizini bulunmaya çalýþýlýrkan hata oluþtu: %m

source: ext2fs_new_@b: %m while trying to create /@l @d
tr: ext2fs_new_block: %m /lost+found dizini oluþturulmaya çalýþýlýrkan hata oluþtu.

source: ext2fs_new_@i: %m while trying to create /@l @d
tr: ext2fs_new_inode: %m /lost+found dizini oluþturulmaya çalýþýlýrkan hata oluþtu.

source: ext2fs_new_dir_@b: %m while creating new @d @b
tr: ext2fs_new_dir_block: %m yeni dizin bloðu oluþturulurken hata.

source: ext2fs_write_dir_@b: %m while writing the @d @b for /@l
tr: ext2fs_write_dir_block: %m /lost+found için dizin bloðu yazýlýrken hata oluþtu.

source: Error while adjusting @i count on @i %i
tr: Düðüm %i üzerinde düðüm sayýsý ayarlanýrken hata oluþtu

source: Couldn't fix parent of @i %i: %m
tr: Düðüm %i için üst düðüm belirlenemedi: %m

source: Couldn't fix parent of @i %i: Couldn't find parent @d entry
tr: Düðüm %i için üst düðüm belirlenemedi: üst dizin girdisi bulunamadý

source: @A @i @B (%N): %m
tr: Düðüm biteþlemi (%N) ayrýlýrken hata oluþtu: %m

source: Error creating root @d (%s): %m
tr: Kök dizini oluþturulurken hata (%s): %m

source: Error creating /@l @d (%s): %m
tr: /lost+found dizini oluþturulurken hata (%s): %m

source: @r is not a @d; aborting.
tr: Kök düðümü bir dizin deðil; çýkýlýyor.

source: Cannot proceed without a @r.
tr: Bir kök düðümü olmaksýzýn iþlenemez.

source: /@l is not a @d (ino=%i)
tr: /lost+found bir dizin deðil (düðüm = %i)

source: Pass 3A: Optimizing directories
tr: Pass 3A: Dizinler eniyileniyor

source: Failed to create dirs_to_hash iterator: %m
tr: dirs_to_hash yineleyici oluþturulamadý: %m

source: Failed to optimize directory %q (%d): %m
tr: Dizin %q (%d) eniyilenemedi: %m

source: Optimizing directories:
tr: Eniyilenen dizinler:

source: Pass 4: Checking reference counts
tr: Geçiþ 4: Baþvuru sayýsý denetleniyor

source: @i %i ref count is %Il, @s %N.
tr: Düðüm %i için baþvuru sayýsý %Il, %N olmalýydý.

source: WARNING: PROGRAMMING BUG IN E2FSCK! OR SOME BONEHEAD (YOU) IS CHECKING A MOUNTED (LIVE) FILESYSTEM. @i_link_info[%i] is %N, @i.i_links_count is %Il. They should be the same!
tr: UYARI: E2FSCK'DA YAZILIM HATASI! YA DA BÝR MANKAFA (SÝZ) BAÐLI (CANLI) DOSYA SÝSTEMÝNÝ DENETLETÝYOR. (pardon, yazar BONEHEAD (YOU) yazmýþ da) düðüm_baðý_bilgileri[%i] = %N, düðüm.düðüm_baðý_sayýsý = %Il. Bunlar ayný olmalýydý!

source: Pass 5: Checking @g summary information
tr: 5. Geçiþ: grup özet bilgileri denetleniyor

source: Padding at end of @i @B is not set.
tr: Düðüm biteþleminin sonundaki alan belirlenmemiþ.

source: Padding at end of @b @B is not set.
tr: Blok biteþleminin sonundaki alan belirlenmemiþ.

source: @b @B differences:
tr: blok biteþlemi farklarý:

source: @i @B differences:
tr: düðüm biteþlemi farklarý:

source: Free @is count wrong for @g #%g (%i, counted=%j).
tr: %g. grup için serbest düðüm sayýsý yanlýþ (%i, sayýlan = %j).

source: Directories count wrong for @g #%g (%i, counted=%j).
tr: %g. grup için dizin sayýsý yanlýþ (%i, sayýlan = %j).

source: Free @is count wrong (%i, counted=%j).
tr: Serbest düðüm sayýsý yanlýþ (%i, sayýlan = %j).

source: Free @bs count wrong for @g #%g (%b, counted=%c).
tr: %g. grup için serbest blok sayýsý yanlýþ (%b, sayýlan = %c).

source: Free @bs count wrong (%b, counted=%c).
tr: Serbest blok sayýsý yanlýþ (%b, sayýlan = %c).

source: PROGRAMMING ERROR: @f (#%N) @B endpoints (%b, %c) don't match calculated @B endpoints (%i, %j)
tr: PROGRAMLAMA HATASI: dosya sistemi (#%N) biteþlem sýnýrlarý (%b, %c) ile hesaplanan biteþlem sýnýrlarý (%i, %j) uyuþmuyor

source: Internal error: fudging end of bitmap (%N)
tr: Ýç hata: biteþlemin sonunda bozulma (%N)

source: Unhandled error code (0x%x)!
tr: Elde edilemeyen hata kodu ((0x%x)!

source: IGNORED
tr: YOKSAYILDI

source: Memory used: %d, elapsed time: %6.3f/%6.3f/%6.3f
tr: Kullanýlan bellek: %d, geçen süre: %6.3f/%6.3f/%6.3f

source: size of inode=%d
tr: düðüm uzunluðu = %d

source: while starting inode scan
tr: - düðüm taramasý baþlatýlýrken hata oluþtu

source: while doing inode scan
tr: - düðüm taramasý yapýlýrken hata oluþtu

source: while calling ext2fs_block_iterate for inode %d
tr: Düðüm %d için ext2fs_block_iterate iþlevi çaðrýlýrken hata oluþtu

source: while calling ext2fs_adjust_ea_refocunt for inode %d
tr: Düðüm %d için ext2fs_block_iterate iþlevi çaðrýlýrken hata oluþtu

source: Truncating
tr: Kýrpýlýyor

source: Clearing
tr: Temizleniyor

source: while calling ext2fs_block_iterate
tr: ext2fs_block_iterate iþlevi çaðrýlýrken hata oluþtu

source: while calling iterator function
tr: - yineleme iþlevi çaðrýlýrken hata oluþtu

source: while allocating inode buffer
tr: - düðüm tampon belleði ayrýlýrken hata oluþtu

source: while reading inode table (group %d)
tr: - düðüm tablosu okunurken hata oluþtu (grup %d)

source: while writing inode table (group %d)
tr: - düðüm tablosu yazýlýrken hata oluþtu (grup %d)

source: Pass 0: Doing byte-swap of filesystem
tr: Geçiþ 0: dosya sisteminin bayt sýralamasý düzeltiliyor

source: %s: the filesystem must be freshly checked using fsck and not mounted before trying to byte-swap it.
tr: %s: dosya sitemi fsck kullanýlarak tamamen denetlenmeli ve ters baytlar normal düzene döndürülmeden baðlanmamalýdýr.

source: Byte swap
tr: Ters baytlý

source: Usage: %s [-panyrcdfvstDFSV] [-b superblock] [-B blocksize] [-I inode_buffer_blocks] [-P process_inode_size] [-l|-L bad_blocks_file] [-C fd] [-j ext-journal] [-E extended-options] device
tr: Kullanýmý: %s [-panyrcdfvstDFSV] [-b superblok] [-B blokboyu] [-I düðüm_tamponu_blok_sayýsý] [-P iþlem_dosya_indeksi_boyu] [-l|-L hatalý_bloklar_dosyasý] [-C dosya_tanýmlayýcý] [-j dýþ_jurnal_aygýtý] [-E ek_seçenekler] aygýt Linux ikinci geliþmiþ dosya sisteminin (e2fs) denetlenmesi için kullanýlýr. ext3 desteklenmiþtir. Seçenekler: -a -p ile ayný -C dosya_tanýmlayýcý e2fsck'yý çalýþtýran uygulamalarca kullanýlýr -d Hata ayýklama iletilerini gösterir -D dizinler eniyilenir -F tampon bellek iþlem öncesi boþaltýlýr -r bu seçenek yoksayýlýr -s dosya sistemi bayt sýralamasý tersse kullanýlýr. Normal sýrada ise etkisizdir. -S Mevcut bayt sýralamasýna bakýlmaksýzýn dosya sisteminin bayt sýralamasý ters çevrilir -t istatistikler gösterilir, iki kere verilmiþse her geçiþin istatistikleri de gösterilir. -V sürüm bilgileri gösterilir ve çýkar Çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net> adresine bildiriniz.

source: -v Be verbose -b superblock Use alternative superblock -B blocksize Force blocksize when looking for superblock -j external-journal Set location of the external journal -l bad_blocks_file Add to badblocks list -L bad_blocks_file Set badblocks list
tr: -v ayrýntýlý bilgi verilir -b superblok normal süperblok yerine belirtilen kullanýlýr -B blokboyu süperblok aranýrken kullanýlan blok boyu yerine belirtilen kullanýlýr -j dýþ-jurnal-aygýtý jurnal dosyasýnýn aranacaðý aygýt belirtilir -l hatalý_bloklar_dosyasý belirtilen dosyadaki hatalý bloklar listeye eklenir -L hatalý_bloklar_dosyasý hatalý bloklar listesi belirtilen dosyadakiler ile oluþturulur

source: %s: %d/%d files (%0d.%d%% non-contiguous), %d/%d blocks
tr: %s: %d/%d dosya (%%%0d.%d yanyana olmayan düðüm), %d/%d blok

source: # of inodes with ind/dind/tind blocks: %d/%d/%d
tr: ind/dind/tind bloklarýnýn düðüm sayýlarý: %d/%d/%d

source: while determining whether %s is mounted.
tr: - %s'in baðlý olup olmadýðý saptanmaya çalýþýlýrken hata oluþtu.

source: Warning! %s is mounted.
tr: Uyarý! %s baðlý.

source: %s is mounted.
tr: %s baðlandý.

source: Cannot continue, aborting.
tr: Devam edilemiyor. çýkýlýyor.

source: WARNING!!! Running e2fsck on a mounted filesystem may cause SEVERE filesystem damage.
tr: U****YARI!****e2fsck'nýn baðlý bir dosya sisteminde çalýþtýrýlmasý ÇOK CÝDDÝ hasarlara sebep olabilir.****n

source: Do you really want to continue
tr: Gerçekten devam etmek istiyor musunuz?

source: check aborted.
tr: denetim durdu.

source: contains a file system with errors
tr: hatalý bir dosya sistemi içeriyor

source: was not cleanly unmounted
tr: usulünce sistemden ayrýlmamýþ

source: has been mounted %u times without being checked
tr: denetlenmeksizin %u kere baðlandý

source: has gone %u days without being checked
tr: denetlenmeksizin %u gün geçti

source: , check forced.
tr: , denetim baþlatýlacak.

source: %s: clean, %d/%d files, %d/%d blocks
tr: %s: temiz, %d/%d dosya, %d/%d blok

source: ERROR: Couldn't open /dev/null (%s)
tr: HATA: /dev/null açýlamadý (%s)

source: Invalid EA version.
tr: Ek özellik sürümü geçersiz.

source: Extended options are separated by commas, and may take an argument which is set off by an equals ('=') sign. Valid raid options are: ea_ver=<ea_version (1 or 2)
tr: Belirtilen ek seçenekler hatalý. Ek seçenekler '=' iþaretli çiftler virgüllerle ayrýlarak verilir. Geçerli raid seçenekleri: ea_ver=<ek_özellik_sürümü> (1 ya da 2)

source: Error validating file descriptor %d: %s
tr: Dosya tanýmlayýcý %d deðerlendirilirken hata: %s

source: Invalid completion information file descriptor
tr: Tamamlama bilgisi dosya tanýmlayýcýsý geçersiz

source: The -t option is not supported on this version of e2fsck.
tr: -t seçeneði e2fsck'nýn bu sürümünde desteklenmiyor.

source: Byte-swapping filesystems not compiled in this version of e2fsck
tr: e2fsck'nýn bu sürümünde derlenmemiþ ters baytlý sistemler

source: Incompatible options not allowed when byte-swapping.
tr: Ters baytlar düzeltilirken uyumsuz seçeneklere izin verilmez.

source: The -c and the -l/-L options may not be both used at the same time.
tr: -c seçeneði ile -l ve -L seçenekleri ayný anda birlikte kullanýlamaz.

source: Error: ext2fs library version out of date!
tr: Hata: ext2fs kitaplýk sürümü uygun deðil!

source: while trying to initialize program
tr: - uygulama baþlatýlmaya çelýþýlýrken hata oluþtu

source: Using %s, %s
tr: %s, %s kullanýlýyor

source: need terminal for interactive repairs
tr: etkileþimli onarým için uçbirim gerekli

source: %s trying backup blocks...
tr: %s yedekleme bloklarý deneniyor...

source: Couldn't find ext2 superblock,
tr: ext2 süperbloðu bulunamadý,

source: Group descriptors look bad...
tr: Grup tanýmlayýcýlar hatalý görünüyor...

source: The filesystem revision is apparently too high for this version of e2fsck. (Or the filesystem superblock is corrupt)
tr: Dosya sistemi e2fsck'nýn bu sürümünden daha yüksek bir sürümü destekliyor gibi. (Ya da dosya sisteminin süperbloðu bozuk olabilir)

source: Could this be a zero-length partition?
tr: Bu sýfýr uzunluklu bir disk bölümü olabilir mi?

source: You must have %s access to the filesystem or be root
tr: Dosya sistemine %s eriþiminiz olmalý ya da root olmalýsýnýz

source: Possibly non-existent or swap device?
tr: Bu mevcut olmayan bir aygýt ya da bir takas aygýtý mý acaba?

source: Disk write-protected; use the -n option to do a read-only check of the device.
tr: Disk yazma korumalý; -n seçeneðini kullanarak salt-oku kipinde denetim yapýnýz.

source: Get a newer version of e2fsck!
tr: e2fsck'nýn daha yeni bir sürümünü alýn!

source: while checking ext3 journal for %s
tr: - %s için ext3 jurnali denetlenirken hata oluþtu

source: Warning: skipping journal recovery because doing a read-only filesystem check.
tr: Uyarý: Dosya sistemi salt-oku kipinde denetlendiðinden jurnal kurtarmasý atlanýyor.

source: while recovering ext3 journal of %s
tr: - %s ext3 jurnal dosyasý kurtarýlmaya çalýþýlýrken hata oluþtu

source: Warning: compression support is experimental.
tr: Uyarý: sýkýþtýrma desteði deneyseldir.

source: E2fsck not compiled with HTREE support, but filesystem %s has HTREE directories.
tr: E2fsck HTREE desteði ile derlenmemiþ, ama dosya sistemi %s HTREE dizinleri içeriyor.

source: %s: Filesystem byte order already normalized.
tr: %s Dosya sisteminde baytlar zaten normal.

source: while reading bad blocks inode
tr: - hatalý bloklar düðümü okunmaya çalýþýlýrken hata oluþtu

source: This doesn't bode well, but we'll try to go on...
tr: Bu pek hayra alamet deðil, ama üstüne gidilecek...

source: Restarting e2fsck from the beginning...
tr: e2fsck baþtan baþlýyor...

source: while resetting context
tr: - baðlam sýfýrlanýrken hata oluþtu

source: %s: e2fsck canceled.
tr: %s: e2fsck durduruldu.

source: aborted
tr: çýktý

source: %s: ***** FILE SYSTEM WAS MODIFIED *****
tr: %s: ***** DOSYA SÝSTEMÝ DEÐÝÞTÝRÝLDÝ *****

source: %s: ***** REBOOT LINUX *****
tr: %s: ***** MAKÝNAYI YENÝDEN BAÞLATIN *****

source: %s: ********** WARNING: Filesystem still has errors **********
tr: %s: ********** UYARI: Dosya sistemi hala hatalý **********

source: yY
tr: eE

source: nN
tr: hH

source: <y>
tr: <e>

source: <n>
tr: <h>

source: (y/n)
tr: (e/h)

source: cancelled!
tr: durduruldu!

source: yes
tr: evet

source: no
tr: hayýr

source: %s? no
tr: %s? hayýr

source: %s? yes
tr: %s? evet

source: yes
tr: evet

source: no
tr: hayýr

source: e2fsck_read_bitmaps: illegal bitmap block(s) for %s
tr: e2fsck_read_bitmaps: %s için biteþlem bloklarý kuraldýþý

source: reading inode and block bitmaps
tr: düðüm ve blok biteþlemleri okunuyor

source: while retrying to read bitmaps for %s
tr: - %s için biteþlemlerin okunmasý yinelenirken hata oluþtu

source: writing block bitmaps
tr: blok biteþlemleri yazýlýyor

source: while retrying to write block bitmaps for %s
tr: - %s için blok biteþlemlerinin yazýlmasý yinelenirken hata oluþtu

source: writing inode bitmaps
tr: düðüm biteþlemleri yazýlýyor

source: while retrying to write inode bitmaps for %s
tr: - %s için düðüm biteþlemlerinin yazýlmasý yinelenirken hata oluþtu

source: %s: UNEXPECTED INCONSISTENCY; RUN fsck MANUALLY. (i.e., without -a or -p options)
tr: %s: BEKLENMEYEN UYGUNSUZLUK; fsck ÇALIÞTIRMALISINIZ. (-a ve -p seçeneklerini kullanmadan)

source: Memory used: %dk/%dk (%dk/%dk),
tr: Kullanýlan bellek: %dk/%dk (%dk/%dk),

source: Memory used: %d,
tr: Kullanýlan bellek: %d,

source: time: %5.2f/%5.2f/%5.2f
tr: zaman: %5.2f/%5.2f/%5.2f

source: elapsed time: %6.3f
tr: geçen süre: %6.3f

source: while reading inode %ld in %s
tr: - %ld düðümü %s den okunurken hata oluþtu

source: while writing inode %ld in %s
tr: - %ld düðümü %s e yazýlýrken hata oluþtu

source: done
tr: bitti

source: during seek
tr: eriþim sýrasýnda

source: Weird value (%ld) in do_read
tr: do_read için tuhaf deðer (%ld)

source: during ext2fs_sync_device
tr: ext2fs_sync_device sýrasýnda

source: while beginning bad block list iteration
tr: - hatalý blok listesi yinelemesine baþlanýrken hata oluþtu

source: while allocating buffers
tr: - tampon bellek ayrýlýrken hata oluþtu

source: Checking for bad blocks in read-only mode
tr: Hatalý bloklar salt-okunur kipte denetleniyor

source: Checking for bad blocks (read-only test):
tr: Hatalý bloklar için denetleniyor (salt-oku testi):

source: Checking for bad blocks in read-write mode
tr: Hatalý bloklar oku-yaz kipinde denetleniyor

source: From block %lu to %lu
tr: Blok %lu dan %lu ya kadar

source: Reading and comparing:
tr: Okunuyor ve karþýlaþtýrýlýyor:

source: Checking for bad blocks in non-destructive read-write mode
tr: Hatalý bloklar veri bozmayan oku-yaz kipinde denetleniyor

source: Interrupt caught, cleaning up
tr: Kesme yakalandý, kaldýrýlýyor

source: during test data write, block %lu
tr: veri yazma denemesi sýrasýnda, blok %lu

source: %s is mounted;
tr: %s baðlandý;

source: badblocks forced anyway. Hope /etc/mtab is incorrect.
tr: badblocks n'olursa olsun çalýþtýrýlacak. Ýnþallah /etc/mtab yanlýþtýr.

source: it's not safe to run badblocks!
tr: 'badblocks' çalýþtýrmak güvenli deðil!

source: bad block size - %s
tr: blok uzunluðu hatalý - %s

source: Couldn't determine device size; you must specify the size manually
tr: Aygýt alaný saptanamadý; Elle bir deðer girmelisiniz

source: while trying to determine device size
tr: - aygýt alaný saptanmaya çalýþýlýrken hata oluþtu

source: bad blocks count - %s
tr: blok sayýsý hatalý - %s

source: bad starting block - %s
tr: baþlangýç bloðu hatalý - %s

source: bad blocks range: %lu-%lu
tr: hatalý bloklar aralýðý: %lu-%lu

source: creating in-memory bad blocks list
tr: hatalý bloklar listesi bellekte oluþturuluyor

source: adding to in-memory bad block list
tr: bellekteki hatalý bloklar listesine ekleniyor

source: Pass completed, %u bad blocks found.
tr: Geçiþ tamamlandý, %u hatalý blok bulundu.

source: usage: %s [-RV] [-+=AacDdijsSu] [-v version] files...
tr: kullanýmý: %s [-RV] [-+=AacDdijsSu] [-v sürüm] dosyalar... Dosya özelliklerini deðiþtirmekte kullanýlýr. Sembolik kip seçenekleri: Bu kipte özellikler + ile mevcut seçeneklere eklenir, - ile kaldýrýlýr, = ile sadece belirtilen özellikler içerilir. A: eriþim zamaný güncellenmez a: sadece dosyanýn sonuna ekleme yapýlabilir. root deðiþtirebilir. c: sýkýþtýrýlmýþ; dosyanýn okuma-yazma sýrasýndaki açýlmasý/sýkýþtýrýlmasý çekirdeðin denetimindedir. d: dökümlenmez; dump uygulamasýndan etkilenmez. D: bir dizine uygulanýr ve dizindeki deðiþiklikler eþzamanlý iþlenir. i: deðiþmez; dosya içeriði silinemez, yazýlamaz, dosyaya bað oluþturulamaz ve ismi deðiþtirilemez. Sadece root bu özelliði deðiþtirebilir. j: jurnal; dosya sistemi ext3 olarak baðlanmýþsa bu özellik etkisizdir s: silinme güvenliði; bu özellik verilen bir dosya silindiðinde veri alaný sýfýrlarla doldurulur S: eþzamanlý güncellemeler; bu özelliði içeren bir dosyaya tüm deðiþiklikler anýnda yazýlýr, sistemin 'sync' seçeneði ile baðlanmasýna eþdeðer özellik saðlar u: silinememezlik; bu dosya silindiðinde içeriði saklanýr, silecek kullanýcýya silinme sýrasýnda sorulmasýný saðlar. Seçenekler: -R dizinler ve içeriklerinde ardýþýk iþlem yapýlýr -V sürüm bilgisi ile iþlem hakkýnda daha ayrýntýlý bilgi verilir -v sürüm dosyanýn sürüm/üretim numarasý belirtilir Çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net> adresine bildiriniz.

source: bad version - %s
tr: sürüm hatalý - %s

source: while trying to stat %s
tr: - stat %s yapýlmaya çalýþýlýrken hata oluþtu

source: Flags of %s set as
tr: Belirlenen %s bayraklarý:

source: while reading flags on %s
tr: - %s üzerinde bayraklar okunurken hata oluþtu

source: while setting flags on %s
tr: - %s üzerinde bayraklar belirlenirken hata oluþtu

source: Version of %s set as %lu
tr: %s sürümü %lu olarak belirlendi

source: while setting version on %s
tr: - %s üzerinde sürüm belirlenirken hata oluþtu

source: Couldn't allocate path variable in chattr_dir_proc
tr: chattr_dir_proc iþlevinde dosya yolu deðiþkenine yer ayrýlamadý

source: = is incompatible with - and +
tr: = ile + ve - uyumsuz

source: Must use '-v', =, - or +
tr: '-v', =, - veya + kullanýlmalý

source: Usage: %s [-bfhixV] [-ob superblock] [-oB blocksize] device
tr: Kullanýmý: %s [-bfhixV] [-ob süperblok] [-oB blokboyu] aygýt Dosya sistemi bilgilerini dökümler. Seçenekler: -b hatalý olarak imlenmiþ bloklarý gösterir -f dosya sistemi dumpe2fs'in bilmediði özellikler içerse bile bilgilerin dökümlenmesini saðlar -h grup tanýmlayýcýlarý deðil sadece süperblok bilgilerini gösterir -i belirtilen aygýt için e2image tarafýndan oluþturulmuþ disk görüntüsü dosyasýnýn verilerini gösterir -x ayrýntýlý olarak gruplarýn bilgileri gösterilir -V sürüm bilgileri gösterilir ve çýkar -ob süperblok dosya sistemini tanýmlayan süperblok belirtilir -oB blokboyu dosya sistemini tanýmlayan blok uzunluðu belirtilir Çeviri hatalarýný <gnu-tr-u12a@lists.sourceforge.net> adresine bildiriniz.

source: Group %lu: (Blocks
tr: Grup %lu: (Bloklar:

source: %s superblock at
tr: %s süperblok:
