Repository: tytso/e2fsprogs
Catalog: po/*.po
Languages: tr

source: Bad block %u out of range; ignored.
tr: Hatalý blok %u kapsamdýþý; yoksayýldý.

source: while sanity checking the bad blocks inode
tr: - hatalý bloklar düðümünde doðruluk denetlenirken hata oluþtu

source: while reading the bad blocks inode
tr: - hatalý bloklar düðümü okunurken hata oluþtu

source: while trying to open %s
tr: - %s açýlmaya çalýþýlýrken hata oluþtu

source: while trying popen '%s'
tr: - '%s' veri yolu açýlmaya çalýþýlýrken hata oluþtu

source: while reading in list of bad blocks from file
tr: - dosyadan hatalý bloklar listesinin okunmasý sýrasýnda hata oluþtu

source: while updating bad block inode
tr: - hatalý bloklar düðümü güncellenirken hata oluþtu

source: Warning illegal block %u found in bad block inode. Cleared.
tr: Uyarý: Kuraldýþý %u bloðu hatalý bloklar düðümünde bulundu. Temizlendi.

source: Error reading block %lu (%s) while %s.
tr: %3$s iþlemi sýrasýnda blok %1$lu okunurken hata oluþtu (%2$s).

source: Error reading block %lu (%s).
tr: blok %lu okunurken hata oluþtu (%s).

source: Ignore error
tr: Hata görmezden gelindi

source: Force rewrite
tr: Yeniden yaz

source: Error writing block %lu (%s) while %s.
tr: %3$s iþlemi sýrasýnda blok %1$lu yazýlýrken hata oluþtu (%2$s).

source: Error writing block %lu (%s).
tr: %lu bloðu yazýlýrken hata: %s.

source: empty dirblocks
tr: boþ dizin bloklarý

source: empty dir map
tr: boþ dizin eþlemi

source: Empty directory block %d (#%d) in inode %d
tr: Düðüm %3d deki dizin bloku %1d (#%2d) boþ

source: %s: %s filename nblocks blocksize
tr: %s: %s dosya_ismi blok_sayýsý blok_boyu

source: Illegal number of blocks!
tr: Blok sayýsý kuraldýþý!

source: Couldn't allocate block buffer (size=%d)
tr: Blok tamponu ayrýlamadý (boyu=%d)

source: Usage: %s disk
tr: Kullanýmý: %s disk

source: BLKFLSBUF ioctl not supported! Can't flush buffers.
tr: BLKFLSBUF ioctl desteklenmiyor! Tamponlar boþaltýlamadý.

source: Usage: %s [-F] [-I inode_buffer_blocks] device
tr: Kullanýmý: %s [-F] [-I düðüm_tampon_bloklarý] aygýt

source: while opening %s for flushing
tr: %s temizlik için açýlýrken hata oluþtu

source: while trying to flush %s
tr: %s boþaltýlmaya çalýþýlýrken hata oluþtu

source: while opening inode scan
tr: düðüm taramasý baþlatýlýrken hata oluþtu

source: while getting next inode
tr: sonraki düðüme geçilirken hata oluþtu

source: %d inodes scanned.
tr: %d düðüm tarandý.

source: reading journal superblock
tr: jurnal super bloku okunuyor

source: %s: no valid journal superblock found
tr: %s: geçerli jurnal super bloku yok

source: %s: journal too short
tr: %s: jurnal çok kýsa

source: %s: recovering journal
tr: %s: jurnal kurtarýlýyor

source: %s: won't do journal recovery while read-only
tr: %s: salt-okunur durumdayken jurnal kurtarmasý yapýlamaz

source: while trying to re-open %s
tr: %s yeniden açýlmaya çalýþýlýrken hata oluþtu

source: aextended attribute
tr: aek özellik

source: Aerror allocating
tr: Aayrýlýrken hata oluþtu

source: bblock
tr: bblok

source: Bbitmap
tr: Bbiteþlem

source: ccompress
tr: csýkýþtýrma

source: Cconflicts with some other fs @b
tr: Cbazý dosya sistemi bloklarý ile çeliþiyor

source: iinode
tr: idüðüm

source: Iillegal
tr: Ikuraldýþý

source: jjournal
tr: jjurnal

source: Ddeleted
tr: Dsilinen

source: ddirectory
tr: ddizin

source: eentry
tr: egirdi

source: E@e '%Dn' in %p (%i)
tr: E@E

source: ffilesystem
tr: fdosya sistemi

source: Ffor @i %i (%Q) is
tr: F%i (%Q) düðümü için

source: ggroup
tr: ggrup

source: hHTREE @d @i
tr: hHTREE dizin düðüm

source: Lis a link
tr: Lbir baðdýr

source: oorphaned
tr: oartýk

source: pproblem in
tr: psorun

source: rroot @i
tr: rkök düðümü

source: sshould be
tr: solmalýydý

source: Ssuper@b
tr: Ssüper blok

source: uunattached
tr: ubaðlantýsýz

source: vdevice
tr: vaygýt

source: zzero-length
tr: zsýfýr uzunluklu

source: <The NULL inode>
tr: <NULL düðüm>

source: <The bad blocks inode>
tr: <Hatalý bloklar düðümü>

source: <The ACL index inode>
tr: <ACL indeksinin düðümü>

source: <The ACL data inode>
tr: <ACL verisinin düðümü>

source: <The boot loader inode>
tr: <Önyükleyici düðümü>

source: <The undelete directory inode>
tr: <Kurtarýlan dizinin düðümü>

source: <The group descriptor inode>
tr: <Grup tanýmlayýcý düðümü>

source: <The journal inode>
tr: <Jurnal düðümü>

source: <Reserved inode 9>
tr: <Yedek düðüm 9>

source: <Reserved inode 10>
tr: <Yedek düðüm 10>

source: multiply claimed inode map
tr: tekrarlanan bloklarýn düðüm eþlemi

source: internal error; can't find dup_blk for %d
tr: iç hata; %d için dup_blk bulunamýyor

source: returned from clone_file_block
tr: clone_file_block iþlevinden döndürüldü

source: in-use inode map
tr: kullanýmdaki düðüm eþlemi

source: directory inode map
tr: dizin düðümü eþlemi

source: regular file inode map
tr: normal dosya düðümü eþlemi

source: in-use block map
tr: kullanýmdaki blok eþlemi

source: doing inode scan
tr: düðüm taramasý yapýlýyor

source: Pass 1
tr: 1. geçiþ

source: reading indirect blocks of inode %u
tr: %u düðümünün dolaylý bloklarý okunuyor

source: bad inode map
tr: hatalý düðüm eþlemi

source: inode in bad block map
tr: hatalý blok eþlemindeki düðüm

source: imagic inode map
tr: imagic düðüm eþlemi

source: multiply claimed block map
tr: tekrarlanan bloklarýn eþlemi

source: ext attr block map
tr: ek özellik bloðu eþlemi

source: block bitmap
tr: blok biteþlemi

source: inode bitmap
tr: düðüm biteþlemi

source: inode table
tr: düðüm tablosu

source: Pass 2
tr: 2. geçiþ

source: inode done bitmap
tr: düðümleri indeksli biteþlem

source: Peak memory
tr: Doruk bellek

source: Pass 3
tr: 3. geçiþ

source: inode loop detection bitmap
tr: düðüm döngüsü saptama biteþlemi

source: Pass 4
tr: 4. geçiþ

source: Pass 5
tr: 5. geçiþ

source: (no prompt)
tr: (komut istemi yok)

source: Fix
tr: Düzelt

source: Clear
tr: Temizle

source: Relocate
tr: Konumlandýr

source: Allocate
tr: Tahsis et

source: Expand
tr: Geniþlet

source: Connect to /lost+found
tr: /lost+found a baðlan

source: Create
tr: Oluþtur

source: Salvage
tr: Kurtarýlacaklar

source: Truncate
tr: Kýrp

source: Clear inode
tr: Düðümü temizle

source: Abort
tr: Vazgeç

source: Split
tr: Ayýr

source: Continue
tr: Devam et

source: Clone duplicate/bad blocks
tr: tekrarlý/hatalý bloklalarý kopyala

source: Delete file
tr: Dosyayý Sil

source: Suppress messages
tr: Ýletileri engelle

source: Unlink
tr: Baðý kaldýr

source: Clear HTree index
tr: HTree indeksini temizle

source: (NONE)
tr: (HÝÇBÝRÝ)

source: FIXED
tr: DÜZELTÝLDÝ

source: CLEARED
tr: TEMÝZLENDÝ

source: RELOCATED
tr: KONUMLANDI

source: ALLOCATED
tr: TAHSÝS EDÝLDÝ

source: EXPANDED
tr: GENÝÞLETÝLDÝ

source: RECONNECTED
tr: TEKRAR BAÐLANDI

source: CREATED
tr: OLUÞTURULDU

source: SALVAGED
tr: KURTARILABÝLÝRLER LÝSTELENDÝ

source: TRUNCATED
tr: KIRPILDI

source: INODE CLEARED
tr: DÜÐÜM TEMÝZLENDÝ

source: ABORTED
tr: VAZGEÇÝLDÝ

source: SPLIT
tr: AYRILDI

source: CONTINUING
tr: SÜRÜYOR

source: DUPLICATE/BAD BLOCKS CLONED
tr: TEKRARLI/HATALI BLOKLAR KOPYALANDI

source: FILE DELETED
tr: DOSYA SÝLÝNDÝ

source: SUPPRESSED
tr: ENGELLENDÝ

source: UNLINKED
tr: BAÐ KALDIRILDI

source: HTREE INDEX CLEARED
tr: HTREE ÝNDEKSÝ TEMÝZLENDÝ

source: @b @B for @g %g is not in @g. (@b %b)
tr: %g grubunun blok biteþlemi grup içinde deðil. (blok %b)

source: @i @B for @g %g is not in @g. (@b %b)
tr: %g grubunun düðüm biteþlemi grup içinde deðil. (blok %b)

source: @i table for @g %g is not in @g. (@b %b) WARNING: SEVERE DATA LOSS POSSIBLE.
tr: %g grubunun düðüm tablosu grup içinde deðil. (blok %b) UYARI: CÝDDÝ VERÝ KAYBI OLASILIÐI.

source: The @S could not be read or does not describe a correct ext2 @f. If the @v is valid and it really contains an ext2 @f (and not swap or ufs or something else), then the @S is corrupt, and you might try running e2fsck with an alternate @S: e2fsck -b %S <@v>
tr: Süper blok okunamýyor ya da doðru ext2 dosya sistemi tanýmlamýyor. Aygýt geçerliyse ve gerçekten bir ext2 dosya sistemi içeriyorsa, (ve bir takas bölümü veya ufs ya da her neyse deðilse) süper blok bozulmuþ demektir. Baþka bir süper blok ile e2fsck çalýþtýrmayý denemelisiniz: e2fsck -b %S <aygýt>

source: The @f size (according to the @S) is %b @bs The physical size of the @v is %c @bs Either the @S or the partition table is likely to be corrupt!
tr: Dosya sistemi uzunluðu (süper blok ile iliþkili) %b blok, aygýtýn gerçek boyutu ise %c bloktur. Hem süper blok hem de disk bölümleme tablosu bozuk olabilir!

source: @S @b_size = %b, fragsize = %c. This version of e2fsck does not support fragment sizes different from the @b size.
tr: Süper blok blok_uzunluðu = %b, adýmlama_uzunluðu = %c. Bu e2fsck sürümünde adýmlama uzunluklarýnýn blok uzunluklarýndan farklý olmasý desteklenmiyor.

source: @S @bs_per_group = %b, should have been %c
tr: Süper blok grup_baþýna_blok_sayýsý = %b; %c olmalýydý

source: @S first_data_@b = %b, should have been %c
tr: Süper blok ilk_veri_bloðu = %b; %c olmalýydý

source: @f did not have a UUID; generating one.
tr: Dosya sistemi bir UUID içermiyor; bir tane üretiliyor.

source: Note: if there is several inode or block bitmap blocks which require relocation, or one part of the inode table which must be moved, you may wish to try running e2fsck with the '-b %S' option first. The problem may lie only with the primary block group descriptor, and the backup block group descriptor may be OK.
tr: Bilgi: Taþýnmasý gereken düðüm tablosunun bir parçasý olan ya da yeniden konumlanmasý gereken blok biteþlemi bloklarý ya da düðümleri varsa, e2fsck'yý önce '-b %S' seçeneðiyle çalýþtýrmalýsýnýz. Sorun sadece birincil bloðun grup tanýmlayýcýsý ile ilgili olabilir ve yedekleme bloðu grup tanýmlayýcýsý da doðru olabilir.

source: Corruption found in @S. (%s = %N).
tr: Super blok içinde bozukluk saptandý. (%s = %N).

source: Error determining size of the physical @v: %m
tr: Aygýtýn fiziksel uzunluðu saptanýrken hata oluþtu: %m

source: @i count in @S is %i, should be %j.
tr: Süper blok içindeki düðüm sayýsý %i; %j olmalýydý.

source: The Hurd does not support the filetype feature.
tr: Hurd, dosya türü özelliðini desteklemez.

source: @S has a bad ext3 @j (@i %i).
tr: Süper blok hatalý bir jurnal içeriyor (düðüm %i).

source: External @j has multiple @f users (unsupported).
tr: Dýþ jurnal çok sayýda dosya sistemi kullanýcýsý içeriyor. (desteklenmiyor)

source: Can't find external @j
tr: Dýþ jurnal bulunamýyor

source: External @j has bad @S
tr: Dýþ jurnal hatalý süper blok içeriyor

source: External @j does not support this @f
tr: Dýþ jurnal bu dosya sistemini desteklemiyor

source: Ext3 @j @S is unknown type %N (unsupported). It is likely that your copy of e2fsck is old and/or doesn't support this @j format. It is also possible the @j @S is corrupt.
tr: Ext3 jurnal süper blok türü %N bilinmiyor (desteklenmiyor). Bu kopya, bu dosya sistemi tarafýndan desteklenmeyen ve/ya eski bir biçem gibi görünüyor. Ayrýca, jurnal süper bloðunun bozuk olmasý da mümkün.

source: Ext3 @j @S is corrupt.
tr: Ext3 jurnal süper bloðu bozuk.

source: @S doesn't have has_@j flag, but has ext3 @j %s.
tr: Süper blok jurnal_mevcut bayraðý içermiyor, ama ext3 jurnal %s içeriyor.

source: @S has ext3 needs_recovery flag set, but no @j.
tr: Süper blok ext3 kurtarma_gerekir bayraðý içeriyor ama jurnal yok.

source: ext3 recovery flag clear, but @j has data.
tr: exf3 kurtarma bayraðý temiz ama jurnal veri içeriyor.

source: Clear @j
tr: Jurnali Temizle

source: Run @j anyway
tr: Jurnali yine de çalýþtýr

source: Recovery flag not set in backup @S, so running @j anyway.
tr: Yedek süper blokda kurtarma bayraðý temiz olduðundan jurnal herþeye raðmen çalýþacak.

source: %s @o @i %i (uid=%Iu, gid=%Ig, mode=%Im, size=%Is)
tr: %s artýk düðüm %i (kull_kiml=%Iu, grup_kiml=%Ig, kip=%Im, boy=%Is)

source: @I @b #%B (%b) found in @o @i %i.
tr: düðüm %i içindeki blok #%B (%b) kuraldýþý.

source: Already cleared @b #%B (%b) found in @o @i %i.
tr: artýk düðüm %i içindeki blok #%B (%b) zaten temizlenmiþ.

source: @I @o @i %i in @S.
tr: süper blok içindeki artýk düðüm %i kuraldýþý.

source: @I @i %i in @o @i list.
tr: artýk düðüm listesindeki düðüm %i kuraldýþý

source: Ext3 @j @S has an unknown read-only feature flag set.
tr: Ext3 jurnal süper bloðu bilinmeyen salt-okunur özellikli bir bayrak içeriyor.

source: Ext3 @j @S has an unknown incompatible feature flag set.
tr: Ext3 jurnal süper bloðu bilinmeyen uyumsuz özellikli bir bayrak içeriyor.

source: @j version not supported by this e2fsck.
tr: jurnal sürümü bu e2fsck tarafýndan desteklenmiyor.

source: Moving @j from /%s to hidden inode.
tr: jurnal /%s den gizli düðüme taþýnýyor.

source: Error moving @j: %m
tr: jurnal taþýnýrken hata oluþtu: %m

source: Found invalid V2 @j @S fields (from V1 journal). Clearing fields beyond the V1 @j @S...
tr: Geçersiz V2 jurnal süper blok alanlarý bulundu (V1 jurnalinden sonra). V1 jurnal süper bloðundan sonraki alanlar temizleniyor...

source: Pass 1: Checking @is, @bs, and sizes
tr: 1. geçiþ: düðümler, bloklar ve uzunluklar denetleniyor

source: @r is not a @d.
tr: Kök düðümü bir dizin deðil.

source: @r has dtime set (probably due to old mke2fs).
tr: Kök düðümü için dtime belirtilmiþ (eski mke2fs'den dolayý olabilir).

source: Reserved @i %i %Q has bad mode.
tr: Yedek düðüm %i %Q hatalý kip içeriyor.

source: @D @i %i has zero dtime.
tr: Silinen düðüm %i sýfýr dtime içeriyor.

source: @i %i is in use, but has dtime set.
tr: Düðüm %i kullanýmda, ama dtime belirtilmiþ.

source: @i %i is a @z @d.
tr: Düðüm %i bir sýfýr uzunluklu dizindir.

source: @g %g's @b @B at %b @C.
tr: %g grubunun %b deki blok biteþlemi diðer dosya sistemi bloklarý ile çeliþiyor.

source: @g %g's @i @B at %b @C.
tr: %g grubunun %b deki düðüm biteþlemi diðer dosya sistemi bloklarý ile çeliþiyor.

source: @g %g's @i table at %b @C.
tr: %g grubunun %b deki düðüm tablosu diðer dosya sistemi bloklarý ile çeliþiyor.

source: @g %g's @b @B (%b) is bad.
tr: %g grubunun blok biteþlemi (%b) hatalý.

source: @g %g's @i @B (%b) is bad.
tr: %g grubunun düðüm biteþlemi (%b) hatalý.

source: @i %i, i_size is %Is, @s %N.
tr: Düðüm %i düðüm uzunluðu %Is, %N olmalýydý.

source: @i %i, i_@bs is %Ib, @s %N.
tr: Dosya düðüm %i, blok düðümü %Ib, %N olmalýydý.

source: @I @b #%B (%b) in @i %i.
tr: Düðüm %i içindeki blok #%B (%b) kuraldýþý.

source: @b #%B (%b) overlaps @f metadata in @i %i.
tr: Düðüm %i içindeki blok #%B (%b) dosya sistemi metaverisinin üzerine taþýyor.

source: @i %i has illegal @b(s).
tr: Düðüm %i kuraldýþý blok(lar) içeriyor.

source: Too many illegal @bs in @i %i.
tr: Düðüm %i içinde çok fazla kuraldýþý blok.

source: @I @b #%B (%b) in bad @b @i.
tr: Hatalý blok düðümü içindeki blok %B (%b) kuraldýþý.

source: Bad @b @i has illegal @b(s).
tr: Hatalý blok düðümü kuraldýþý blok(lar) içeriyor.

source: Duplicate or bad @b in use!
tr: Tekrarlanmýþ ya da hatalý blok kullanýmda!

source: Bad @b %b used as bad @b indirect @b?!?
tr: Hatalý blok %b, hatalý blok yerine kullanýlan blok olarak kullanýlmýþ?!?

source: This inconsistency can not be fixed with e2fsck; to fix it, use dumpe2fs -b to dump out the bad @b list and e2fsck -L filename to read it back in again.
tr: Bu aykýrýlýk e2fsck ile düzeltilemez; düzeltmek için hatalý bloklar listesini dökümleyecek 'dumpe2fs -b' komutunu ve sonra onu tekrar geriye okuyacak olan 'e2fsck -L dosyaismi' komutunu kullanýn.

source: If the @b is really bad, the @f can not be fixed.
tr: Blok gerçekten hatalýysa, dosya sistemi düzeltilemez.

source: You can clear the this @b (and hope for the best) from the bad @b list and hope that @b is really OK, but there are no guarantees.
tr: Bu bloðu hatalý bloklar listesinden silebilir ve bu bloðun gerçekten doðru olduðunu umabilirsiniz, ancak hiçbir garantisi yoktur.

source: The primary @S (%b) is on the bad @b list.
tr: Birincil dosya sistemi (%b) hatalý bloklar listesinde kayýtlý.

source: Block %b in the primary @g descriptors is on the bad @b list
tr: Birincil grup tanýmlarýndaki blok %b, hatalý bloklar listesinde kayýtlý

source: Warning: Group %g's @S (%b) is bad.
tr: Uyarý: %g grubunun superbloðu (%b) hatalý.

source: Warning: Group %g's copy of the @g descriptors has a bad @b (%b).
tr: Uyarý %g grubunun grup tanýmlarý kopyasý bir hatalý blok içeriyor (%b).

source: Programming error? @b #%b claimed for no reason in process_bad_@b.
tr: Programlama hatasý? blok %b, hatalý blok iþleminde sebepsiz olarak talep edildi.

source: @A %N contiguous @b(s) in @b @g %g for %s: %m
tr: %s için %g blok grubunda %N bitiþik bloða yer ayrýlýrken hata oluþtu: %m

source: @A @b buffer for relocating %s
tr: %s tekrar konumlamasý için blok tamponuna yer ayrýlýrken hata oluþtu

source: Relocating @g %g's %s from %b to %c...
tr: %g grubunun %s %b den %c ye aktarýlýyor...

source: Relocating @g %g's %s to %c...
tr: %g grubunun %s %c ye aktarýlýyor...

source: Warning: could not read @b %b of %s: %m
tr: Uyarý: %snin %b bloðu okunamadý: %m

source: Warning: could not write @b %b for %s: %m
tr: Uyarý: %snin %b bloðu yazýlamadý: %m

source: @A icount link information: %m
tr: Düðüm sayýsý bað bilgisine yer ayrýlýrken hata oluþtu: %m

source: @A @d @b array: %m
tr: Dizin bloðu dizisine yer ayrýlýrken hata oluþtu: %m

source: Error while scanning @is (%i): %m
tr: Düðümler (%i) taranýrken hata oluþtu: %m

source: Error while iterating over @bs in @i %i: %m
tr: Düðüm %i içindeki bloklar üzerinde iþlemler tekrarlanýrken hata oluþtu: %m

source: Error storing @i count information (@i=%i, count=%N): %m
tr: Düðüm sayýsý bilgisi (düðüm = %i, sayýsý = %N) saklanýrken hata oluþtu: %m

source: Error storing @d @b information (@i=%i, @b=%b, num=%N): %m
tr: Dizin bloðu bilgisi (düðüm = %i, blok = %b, num = %N) saklanýrken hata oluþtu: %m

source: Error reading @i %i: %m
tr: Düðüm %i okunurken hata oluþtu: %m

source: @i %i has imagic flag set.
tr: Düðüm %i imagic bayraðý içeriyor.

source: Special (@v/socket/fifo/symlink) file (@i %i) has immutable or append-only flag set.
tr: Özel (aygýt/soket/fifo/sembað) dosya (düðüm %i), salt-eklenir ya da deðiþmez bayraðý içeriyor.

source: @i %i has @cion flag set on @f without @cion support.
tr: Düðüm %i sýkýþtýrma desteklenmeyen dosya sisteminde sýkýþtýrma bayraðý içeriyor.

source: @j is not regular file.
tr: Jurnal normal bir dosya deðil.

source: @i %i was part of the orphaned @i list.
tr: Düðüm %i artýk düðüm listesinin parçasýydý.

source: @is that were part of a corrupted orphan linked list found.
tr: Bozuk bir artýk baðlý listenin bir parçasýný bulunduran düðümler.

source: Error reading @a @b %b for @i %i.
tr: Düðüm %i için ek özellik bloðu %b okunurken hata oluþtu.

source: @i %i has a bad @a @b %b.
tr: Düðüm %i %b hatalý ek özellik bloðunu içeriyor.

source: Error reading @a @b %b (%m).
tr: Ek özellik bloðu %b okunurken hata oluþtu (%m).

source: @a @b %b has reference count %B, should be %N.
tr: Ek özellik bloðu %b %B baþvuru sayýsýna sahip, %N olmalýydý.

source: Error writing @a @b %b (%m).
tr: Ek özellik bloðu %b yazýlýrken hata oluþtu (%m).

source: @a @b %b has h_blocks > 1.
tr: Ek özellik bloðu %b için çoklu EA bloklarý desteklenmiyor.

source: Error allocating @a @b %b.
tr: Ek özellik bloðu %b ayrýlýrken hata oluþtu.

source: @a @b %b is corrupt (allocation collision).
tr: Ek özellik bloðu %b bozuk (tahsis çatýþmasý).

source: @a @b %b is corrupt (invalid name).
tr: Ek özellik bloðu %b bozuk (geçersiz isim).

source: @a @b %b is corrupt (invalid value).
tr: Ek özellik bloðu %b bozuk (geçersiz deðer).

source: @i %i is too big.
tr: düðüm %i çok büyük.

source: @b #%B (%b) causes @d to be too big.
tr: Blok #%B (%b) çok büyük dizin oluþturuyor.

source: @b #%B (%b) causes file to be too big.
tr: Blok #%B (%b) çok büyük dosya oluþturuyor.

source: @b #%B (%b) causes symlink to be too big.
tr: Blok #%B (%b) çok büyük sembolik bað oluþturuyor.

source: @i %i has INDEX_FL flag set on @f without htree support.
tr: Düðüm %i htree desteði bulunmayan dosya sisteminde INDEX_FL bayraðý içeriyor.

source: @i %i has INDEX_FL flag set but is not a @d.
tr: Düðüm %i INDEX_FL bayraðý içeriyor ama o bir dizin deðil.

source: @h %i has an invalid root node.
tr: HTREE dizin düðümü %i geçersiz bir kök düðümü içeriyor.

source: @h %i has an unsupported hash version (%N)
tr: HTREE dizin düðümü %i desteklenmeyen bir hash sürümü (%N) içeriyor.

source: @h %i uses an incompatible htree root node flag.
tr: HTREE dizin düðümü %i uyumsuz bir htree kök düðümü bayraðý kullanýyor.

source: @h %i has a tree depth (%N) which is too big
tr: HTREE dizin düðümü %i çok büyük bir aðaç derinliðine (%N) sahip

source: Duplicate @bs found... invoking duplicate @b passes. Pass 1B: Rescan for duplicate/bad @bs
tr: Tekrarlanmýþ bloklar bulundu... tekrarlanan blok taramasý baþlatýlýyor. Geçiþ 1B: tekrarlanmýþ/hatalý bloklar yeniden taranýyor

source: Duplicate/bad @b(s) in @i %i:
tr: Düðüm %i içindeki tekrarlanmýþ/hatalý blok(lar):

source: Error while scanning inodes (%i): %m
tr: Düðümler (%i) taranýrken hata oluþtu: %m

source: @A @i @B (inode_dup_map): %m
tr: Düðüm biteþlem (inode_dup_map) için yer ayrýlýrken hata oluþtu: %m

source: Error while iterating over @bs in @i %i (%s): %m
tr: Düðüm %i içindeki bloklar üzerindeki iþlemler tekrarlanýrken hata oluþtu (%s): %m

source: Error addjusting refcount for @a @b %b (@i %i): %m
tr: Ek özellik bloðu %b (düðüm %i) için baþvuru sayýsý ayarlanýrken hata oluþtu: %m

source: Pass 1C: Scan directories for @is with dup @bs.
tr: Geçiþ 1C: tekrarlanmýþ bloklu düðümler için dizinler taranýyor.

source: Pass 1D: Reconciling duplicate @bs
tr: Geçiþ 1D: tekrarlanan bloklar yeniden uzlaþýlýyor

source: File %Q (@i #%i, mod time %IM) has %B duplicate @b(s), shared with %N file(s):
tr: Dosya %Q (düðüm %i, deðiþiklik zamaný %IM) tekrarlanan %B blok içeriyor ve %N dosya ile paylaþýmlý:

source: %Q (@i #%i, mod time %IM)
tr: %Q (düðüm %i, deðiþiklik zamaný %IM)

source: <@f metadata>
tr: <dosya sistemi metaverisi>

source: (There are %N @is containing duplicate/bad @bs.)
tr: (Tekrarlanan/hatalý bloklarý içeren %N düðüm var.)

source: Duplicated @bs already reassigned or cloned.
tr: Tekrarlanan bloklar zaten yeniden atandý ya da kopyalandý.

source: Couldn't clone file: %m
tr: Dosya kopyalanamadý: %m

source: Pass 2: Checking @d structure
tr: Geçiþ 2: Dizin yapýsý denetleniyor

source: Bad @i number for '.' in @d @i %i.
tr: Dizin düðümü %i içindeki '.' için düðüm numarasý hatalý.

source: @E has bad @i #: %Di.
tr: @E hatalý düðüm numarasý içeriyor: %Di.

source: @E has @D/unused @i %Di.
tr: @E silinmiþ/kullanýlmayan düðüm %Di içeriyor.

source: @E @L to '.'
tr: @E '.' ya bir baðdýr.

source: @E points to @i (%Di) located in a bad @b.
tr: @E bir hatalý blok içindeki düðümü (%Di) gösteriyor.

source: @E @L to @d %P (%Di).
tr: @E dizin %P (%Di) için bir baðdýr.

source: @E @L to the @r.
tr: @E kök düðümüne bir baðdýr.

source: @E has illegal characters in its name.
tr: @E isminde kuraldýþý karakterler içeriyor.

source: Missing '.' in @d @i %i.
tr: Dizin düðümü %i içinde '.' eksik.

source: Missing '..' in @d @i %i.
tr: Dizin düðümü %i içinde '..' eksik.

source: First @e '%Dn' (inode=%Di) in @d @i %i (%p) @s '.'
tr: Dizin düðümü %i (%p) içindeki ilk girdi '%Dn' (düðüm=%Di) '.' olmalýydý.

source: Second @e '%Dn' (inode=%Di) in @d @i %i @s '..'
tr: Dizin düðümü %i içindeki ilk girdi '%Dn' (düðüm=%Di) '..' olmalýydý.

source: i_faddr @F %IF, @s zero.
tr: düðüm %i (%Q) %IF için i_faddr, sýfýr olmalý.

source: i_file_acl @F %If, @s zero.
tr: düðüm %i (%Q) %If için i_file_acl, sýfýr olmalý.

source: i_dir_acl @F %Id, @s zero.
tr: düðüm %i (%Q) %Id için i_dir_acl, sýfýr olmalý.

source: i_frag @F %N, @s zero.
tr: düðüm %i (%Q) %N için i_frag, sýfýr olmalý.

source: i_fsize @F %N, @s zero.
tr: düðüm %i (%Q) %N için i_fsize, sýfýr olmalý.

source: @i %i (%Q) has a bad mode (%Im).
tr: Düðüm %i (%Q) bir hatalý kip (%Im) içeriyor.
